app/controllers/spojusers_controller.rb

SELECT "spojusers".* FROM "spojusers"
---
   def show
     @spojusers = Spojuser.all

SELECT "spojusers".* FROM "spojusers" WHERE "spojusers"."username" = 'test3'
INSERT INTO "spojusers" ("created_at", "lastUpdate", "updated_at", "username") VALUES (?, ?, ?, ?)  [["created_at", Sun, 06 Nov 2011 18:23:48 UTC +00:00], ["lastUpdate", Sun Nov 06 13:23:48 -0500 2011], ["updated_at", Sun, 06 Nov 2011 18:23:48 UTC +00:00], ["username", "rsalazar"]]
---
   def create
	@spojuser = nil;
	search = Spojuser.where(:username => params[:username])
	if(search == [])
		@spojuser = Spojuser.new(:username => params[:username])
     	@spojuser.lastUpdate = Time.now
    	 @spojuser.save

DELETE FROM "spojusers" WHERE "spojusers"."id" = ?  [["id", 1]]
---
	def destroyall
		Spojuser.destroy_all